{"which": "pronoun. (interrogative) What one or ones (of those mentioned or implied). The/Any ones that; whichever. (relative) Introduces a relative clause giving further information about something previously mentioned. (relative) Used of people (now generally who, whom or that). \n", "there": "noun. That place. That status; that position. \nadverb. (location) In a place or location (stated, implied or otherwise indicated) at some distance from the speaker (compare here). In that matter, relation, etc.; at that point, stage, etc., regarded as a distinct place. (location) To or into that place; thither. Where, there where, in which place. In existence or in this world; see pronoun section below. \npronoun. Used as an expletive subject of be in its sense of “exist”, with the semantic, usually indefinite subject being postponed or (occasionally) implied. Used with other intransitive verbs of existence, in the same sense, or with other intransitive verbs, adding a sense of existence. Used with other verbs, when raised. (in combination with certain prepositions, no longer productive) That. Used to replace an unknown name, principally in greetings and farewells \ninterjection. Used to offer encouragement or sympathy. Used to express victory or completion. \n", "their": "", "about": "adjective. Moving around; astir. In existence; being in evidence; apparent. Near; in the vicinity or neighbourhood. \nadverb. On all sides; around. Here and there; around; in one place and another; up and down. From one place or position to another in succession; indicating repeated movement or activity. Indicating unproductive or unstructured activity. Nearly; approximately; with close correspondence in quality, manner, degree, quantity, or time; almost. Near; in the vicinity. To a reversed order; half round; facing in the opposite direction; from a contrary point of view. In succession; one after another; in the course of events. In circuit; circularly; by a circuitous way; around the outside; in circumference. \npreposition. In a circle around; all round; on every side of; on the outside of. Over or upon different parts of; through or over in various directions; here and there in; to and fro in; throughout. Indicates that something will happen very soon; indicates a plan or intention to do something. Concerning; with regard to; on account of; on the subject of; to affect. Concerned with; engaged in; intent on. Within or in the immediate neighborhood of; in contiguity or proximity to; near, as to place. On one's person; nearby the person. In or near, as in mental faculties or in the possession of; under the control of; at one's command; in one's makeup. \n", "would": "noun. Something that would happen, or would be the case, under different circumstances; a potentiality. \n", "these": "pronoun. The thing, item, etc. being indicated. \n", "other": "noun. An other, another (person, etc), more often rendered as another. The other one; the second of two. \nverb. To regard, label or treat as an \"other\", as not part of the same group; to view as different and alien. To treat as different or separate; segregate; ostracise. \nadjective. See other (determiner) below Second. Alien. Different. Left, as opposed to right. \nadverb. Apart from; in the phrase \"other than\". Otherwise. \n", "words": "noun. The smallest unit of language that has a particular meaning and can be expressed by itself; the smallest discrete, meaningful unit of language. (contrast morpheme.) Something like such a unit of language: The fact or act of speaking, as opposed to taking action. . Something that someone said; a comment, utterance; speech. A watchword or rallying cry, a verbal signal (even when consisting of multiple words). A proverb or motto. News; tidings (used without an article). An order; a request or instruction; an expression of will. A promise; an oath or guarantee. A brief discussion or conversation. (in the plural) See words. (sometimes Word) Communication from God; the message of the Christian gospel; the Bible, Scripture. (sometimes Word) Logos, Christ. \nverb. To say or write (something) using particular words; to phrase (something). To flatter with words, to cajole. To ply or overpower with words. To conjure with a word. To speak, to use words; to converse, to discourse. \nnoun. Angry debate or conversation; argument. Lines in a script for a performance. Lyrics. \n", "could": "verb. (auxiliary verb, defective) To know how to; to be able to. (modal auxiliary verb, defective) May; to be permitted or enabled to. (modal auxiliary verb, defective) To have the potential to; be possible. (auxiliary verb, defective) Used with verbs of perception. To know. \nnoun. Something that could happen, or could be the case, under different circumstances; a potentiality. \n", "write": "noun. The act or style of writing. The operation of storing data, as in memory or onto disk. \nverb. To form letters, words or symbols on a surface in order to communicate. To be the author of (a book, article, poem, etc.). To send written information to. To show (information, etc) in written form. To be an author. (with to) To record data mechanically or electronically. (of an exam, a document, etc.) To fill in, to complete using words. To impress durably; to imprint; to engrave. To make known by writing; to record; to prove by one's own written testimony; often used reflexively. To sell (an option or other derivative). \n", "first": "noun. The person or thing in the first position. The first gear of an engine. Something that has never happened before; a new occurrence. First base A first-class honours degree. A first-edition copy of some publication. A fraction of an integer ending in one. \nadjective. Preceding all others of a series or kind; the ordinal of one; earliest. Most eminent or exalted; most excellent; chief; highest. \nadverb. Before anything else; firstly. For the first time; \n", "water": "noun. A substance (of molecular formula H₂O) found at room temperature and pressure as a clear liquid; it is present naturally as rain, and found in rivers, lakes and seas; its solid form is ice and its gaseous form is steam. The aforementioned liquid, considered one of the Classical elements or basic elements of alchemy. Water in a body; an area of open water. A body of water, almost always a river. A combination of water and other substance(s). (in the plural or in the singular) A state of affairs; conditions; usually with an adjective indicating an adverse condition. A person's intuition. Excess valuation of securities. The limpidity and lustre of a precious stone, especially a diamond. A wavy, lustrous pattern or decoration such as is imparted to linen, silk, metals, etc. \n", "after": "adjective. Later; second (of two); next, following, subsequent (where the frame of reference is within the ship) At or towards the stern of a ship. \nadverb. Behind; later in time; following. \npreposition. Subsequently to; following in time; later than. Behind. In pursuit of, seeking. In allusion to, in imitation of; following or referencing. Next in importance or rank. As a result of. In spite of. (usually preceded by a form of be, followed by an -ing form of a verb) Used to indicate recent completion of an activity According to an author or text. Denoting the aim or object; concerning; in relation to. According to the direction and influence of; in proportion to; befitting. \nconjunction. Signifies that the action of the clause it starts takes place before the action of the other clause. \n", "where": "noun. The place in which something happens. \nadverb. Interrogative adverb, used in either a direct or indirect question: at what place; to what place; what place. In what situation. (relative) At which, on which. \npronoun. The place in which. \nconjunction. While on the contrary; although; whereas. At or in which place or situation. To which place or situation. Wherever. In a position, case, etc., in which. \n", "right": "adjective. Straight, not bent. Of an angle, having a size of 90 degrees, or one quarter of a complete rotation; the angle between two perpendicular lines. Of a geometric figure, incorporating a right angle between edges, faces, axes, etc. Complying with justice, correctness or reason; correct, just, true. Appropriate, perfectly suitable; fit for purpose. Healthy, sane, competent. Real; veritable (used emphatically). All right; not requiring assistance. Most favourable or convenient; fortunate. Designating the side of the body which is positioned to the east if one is facing north. This arrow points to the reader's right: → Designed to be placed or worn outward. Pertaining to the political right; conservative. \n", "think": "noun. An act of thinking; consideration (of something). \nverb. To ponder, to go over in one's head. To communicate to oneself in one's mind, to try to find a solution to a problem. To conceive of something or someone (usually followed by of; infrequently, by on). To be of opinion (that); to consider, judge, regard, or look upon (something) as. To guess; to reckon. To plan; to be considering; to be of a mind (to do something). To presume; to venture. \n", "three": "noun. The digit/figure 3. Anything measuring three units, as length. A person who is three years old. The playing card featuring three pips. \nnumeral. A numerical value after two and before four. Represented in Arabic digits as 3; this many dots (•••). Describing a set or group with three elements. \nnoun. A goal or other means of scoring worth three points. A three-point shot; a basket made from beyond the three-point line. A three-point landing; an airplane landing in which all three wheels touch the ground simultaneously. A deer or other animal whose antlers feature three points or tines. \n", "years": "noun. A solar year, the time it takes the Earth to complete one revolution of the Sun (between 365.24 and 365.26 days depending on the point of reference). (by extension) The time it takes for any astronomical object (such as a planet, dwarf planet, small Solar System body, or comet) in direct orbit around a star (such as the Sun) to make one revolution around the star. A period between set dates that mark a year, from January 1 to December 31 by the Gregorian calendar, from Tishiri 1 to Elul 29 by the Jewish calendar, and from Muharram 1 to Dhu al-Hijjah 29 or 30 by the Islamic calendar. A scheduled part of a calendar year spent in a specific activity. A Julian year, exactly 365.25 days, represented by \"a\". A level or grade in school or college. The proportion of a creature's lifespan equivalent to one year of an average human lifespan (see also dog year). \nnoun. A very long time. \n"}